{
  "HomePage": {
    "title": "Full-Stack Software Engineer (Next.js & Spring Boot)",
    "description": "I'm Rubens Q. Alves, a Full-Stack Software Engineer working with Next.js and Spring Boot, with a strong focus on backend architecture, APIs, and scalable web applications.",
    "githubTitle": "Github Calendar"
  },
  "NavBar": {
    "items": [
      { "label": "About", "href": "/about" },
      { "label": "Projects", "href": "/projects" },
      { "label": "Blog", "href": "/blog" },
      { "label": "Photos", "href": "/photos" }
    ]
  },
  "AboutPage": {
   "resuméButton": "View resumé",
   "title": "I'm Rubens Q. Alves, developer in Brazil.",
   "description1": "I’m a self-motivated software developer focused on full-stack web development and open-source. I enjoy building interactive, well-structured web applications, with a strong emphasis on the client side. My main tools include JavaScript, TypeScript, Next.js, and Spingboot.",
   "description2": "I believe continuous learning comes from experience, so I try to take something valuable from every situation — even the challenging ones.",
   "section1": "Skills",
   "list1": "I enjoy refining designs and UIs with care and precision, focusing on delivering polished results rather than simply shipping more features.",
   "list2": "I use Next.js to build fast, scalable web applications, taking advantage of features like server-side rendering, static generation, and the App Router to improve performance, SEO, and overall user experience.",
   "list3": "I use Spring Boot to develop robust and scalable backend applications, building well-structured, secure, and maintainable APIs with a focus on performance, code organization, and best practices.",
   "section2": "Technologies"
  },
  "Footer": {
    "copyright": "Copyright © Rubens Q. Alves 2026 All rights Reserved"
  },
  "ProjectsPage": {
    "title": "Projects",
    "description": "I’ve built a lot of small projects, but these are the ones I’m most proud of. All of them are open-source, so feel free to dive into the code, explore how things work, and contribute if you have ideas to make them better.",
    "ecommerce": "My personal e-commerce project"
  },
  "NexaShopPage": {
    "overview": "NexaShop is a full-stack e-commerce platform built with Next.js and Spring Boot, designed to provide a smooth and secure shopping experience. The application implements a scalable architecture and supports complete management of the purchasing lifecycle.",
    "overviewApi1": "Powered by the Spring Boot",
    "overviewApi2": "API, NexaShop was designed to handle multiple operations simultaneously, delivering a fast, stable, and scalable application.",
    "featuresDescription": "Originally built as a personal project to deepen my full-stack development skills, NexaShop started as a simple e-commerce application and has since evolved into a modern, scalable platform focused on performance, usability, and clean architecture. With recent improvements and refinements, here are the current features:"
  }
}
